Revit 2024 API
BuiltInFailures.ElectricalFailures.NoAvailableMatchingConnector Property
 Cannot add [Element] to Circuit. There is no available connector matching the Type ([Type Name]) for the Circuit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NoAvailableMatchingConnector { get; }
Visual Basic
Public Shared ReadOnly Property NoAvailableMatchingConnector As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NoAvailableMatchingConnector {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace